public class Main {
  public static void main(String[] args) {
    System.out.println("Hello world!");

//    Напишите программу создания небольшого словаря сленговых программерских выражений,
//    чтобы она потом по запросу возвращала значения из этого словаря.
//    Формат входных данных
//    Файл dict.txt
//    В первой строке задано одно целое число n — количество слов в словаре.
//
//    следующих n строках записаны слова и их определения, разделенные двоеточием и символом пробела.
//
//    Ввод с клавиатуры
//    В первой строке записано целое число m — количество поисковых слов, чье определение нужно вывести.
//
//    В следующих m строках записаны сами слова, по одному на строке.

  }
}